CS142 web/app/models/user.rb

    def User.authenticate(u_name, password)
        User.all.each do |u|
---
SELECT "users".* FROM "users"