CS142 web/app/views/display/_comment.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    At <%= comment.date_time %>
  <%= link_to(comment.user.first_name + " "  +comment.user.last_name, '/pics/user/' + comment.user.id.to_s )%> Says: