CS142 web/app/views/display/_tag.html.erb

  <p >
    <%= tag.user.first_name + " " + tag.user.last_name%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]