CS142 web/app/views/display/goToTag.html.erb

SELECT "users".* FROM "users"
---
   <br>
   <%  users_array = User.all.map { |user| [user.first_name + " " + user.last_name, user.id]} %>