CS142 web/app/views/display/showPhoto.html.erb


    <% @pageTitle = @photo.user.first_name + "'s Photo" %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]


        <% if !@logged_in and @photo.tags.size == 0 %>
---
SELECT "tags".* FROM "tags" WHERE "tags"."photo_id" = ?  [["photo_id", 2]]
SELECT COUNT(*) FROM "tags" WHERE "tags"."photo_id" = ?  [["photo_id", 2]]

                    <img class="photoImg photoImgLarge" src="/images/<%= @photo.file_name %>" alt="Photo of <%= @photo.user.first_name %>"/>
                    <% @photo.tags.each do |tag| %>
                        <div class="tagName" id="tagName-<%= tag.id.to_s %>" style="left: <%= tag.x_coord %>px; top: <%= tag.y_coord - 26 %>px;">
                          <%= tag.user.first_name %>
---
SELECT "tags".* FROM "tags" WHERE "tags"."photo_id" = ?  [["photo_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]


    <% if @logged_in or @photo.comments.size > 0 %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 2]]


            <% @photo.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 9]]