CS142 web/app/views/display/showUser.html.erb


    <% @user.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 5]]

                 otherwise create a single column to center the photo in the middle of the page -->
            <% if !photo.comments.empty? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 2]]
SELECT 1 AS one FROM "comments" WHERE "comments"."photo_id" = ? LIMIT ?  [["photo_id", 9], ["LIMIT", 1]]

            <!-- comments column (if any) -->
            <% if !photo.comments.empty? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 1]]
SELECT 1 AS one FROM "comments" WHERE "comments"."photo_id" = ? LIMIT ?  [["photo_id", 10], ["LIMIT", 1]]


                    <% photo.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 10]]

            <!-- tags column (if any) -->
             <% if !photo.tags.empty? %>
---
SELECT 1 AS one FROM "tags" WHERE "tags"."photo_id" = ? LIMIT ?  [["photo_id", 6], ["LIMIT", 1]]

                    <p>People tagged</p>
                    <% photo.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" WHERE "tags"."photo_id" = ?  [["photo_id", 6]]