CS142 web/app/controllers/display_controller.rb

    def allPhotos
      @phs = Photo.all
---
SELECT "photos".* FROM "photos"

    def allUsers
      @users = User.all
---
SELECT "users".* FROM "users"

    def showUser
      if params[:id] and User.exists?(params[:id])
        @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def newComment
      u = current_user
      if u
        @photo = Photo.find(params[:photo_id])
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

    def createComment
      #TODO to be improve
      cm = params[:comment]
      if cm.nil? or cm.empty?
        flash[:alert] = "comment must not be empty!"
        redirect_to :action => :newComment, :photo_id => params[:photo_id]
        return
      end

      comment = Comment.new(:date_time => DateTime.current,
          :comment => params[:comment])
      comment.user_id = params[:user_id]
      comment.photo_id = params[:photo_id]
      respond_to do |fm|
        if comment.save
---
INSERT INTO "comments" ("photo_id", "user_id", "date_time", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["photo_id", 1], ["user_id", 7], ["date_time", "2020-01-10 00:40:37.390983"], ["comment", "wsas"], ["created_at", "2020-01-10 00:40:37.401247"], ["updated_at", "2020-01-10 00:40:37.401247"]]

    def showPhoto
      if current_user
        @logged_in = true
        @new_comment = Comment.new()
        @new_comment.user = User.find(current_user.id)
      end

      if params[:id] and Photo.exists?(params[:id])
        @photo = Photo.find(params[:id])
        @tagged_users = []
        @photo.tags.each { |t| @tagged_users << (t.user.first_name + t.user.last_name) }
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 2]]
SELECT "tags".* FROM "tags" WHERE "tags"."photo_id" = ?  [["photo_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def uploadPhoto
      file = params[:file]
      if file
        puts params[:user_id]
        filename = uploadFile(file)
        if filename
          photo = Photo.new(:date_time => DateTime.current,
                            :file_name => filename)
          photo.user_id = params[:user_id]

          respond_to do |fm|
            if photo.save
---
INSERT INTO "photos" ("user_id", "date_time", "file_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def goToTag
      u = current_user
      if u
        @photo = Photo.find(params[:photo_id])
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

    def createTag
      #@photo = Photo.find(params[:photo_id])
      #@tagUser = User.find(params[:user_id])
      tag = Tag.new(:photo_id => params[:photo_id],
                    :user_id => params[:tag][:user_id],
                    :x_coord => params[:x_coord],
                    :y_coord => params[:y_coord],
                    :width => params[:width],
                    :height => params[:height],)
      tag.save!
---
INSERT INTO "tags" ("photo_id", "user_id", "x_coord", "y_coord", "width", "height", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["photo_id", 6], ["user_id", 3], ["x_coord", 100], ["y_coord", 65], ["width", 149], ["height", 125], ["created_at", "2020-01-14 20:31:31.952718"], ["updated_at", "2020-01-14 20:31:31.952718"]]

    def show_thumb
      @searchStr = params[:str]

      comments = Comment.where('comment LIKE ?', "%#{@searchStr}%").all
      firstUsers = User.where('first_name LIKE ?', "%#{@searchStr}%").all
      lastUsers = User.where('last_name LIKE ?', "%#{@searchStr}%").all
      users = firstUsers | lastUsers

      @photos = comments.map{ |c| c.photo } | users.flat_map{ |u| u.photos }
---
SELECT "comments".* FROM "comments" WHERE (comment LIKE '%j%')
SELECT "users".* FROM "users" WHERE (first_name LIKE '%j%')
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]