CS142 web/app/controllers/register_controller.rb

    def handle_registering

        @user = User.new(:login => params[:username], :first_name => params[:first_name], :last_name => params[:last_name])
        @user.hashed_password = @user.get_hashed_password(params[:password])

        if params[:password] != params[:confirm_password]
            flash[:alert] = "password must be the same!"
            render :action => "reg"
            return
        end

        respond_to do |fm|
          if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "created_at", "updated_at", "login", "hashed_password", "salt") VALUES (?, ?, ?, ?, ?, ?, ?)